[
  {
    "type": "FUEGO",
    "strong": ["ACERO", "BICHO", "HIELO", "PLANTA"],
    "weak": ["AGUA", "ROCA", "TIERRA"],
    "ineffective": ["AGUA", "ROCA", "DRAGON", "FUEGO"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/fuego.png",
    "hability": "Existen un total de 30 movimientos de tipo fuego (4,85 % sobre el total), 5 en la primera generación, 3 en la segunda generación, 6 en la tercera generación, 4 en la cuarta generación, 11 en la quinta generación y solo 1 en la sexta generación.En batallas: Destaca el tipo especial. Existen 19 movimientos de tipo Categoría especial Especial, 9 de tipo Categoría físico Físico y 2 pertenecen a la categoría Categoría de estado Otro.En concursos: Destaca el tipo belleza. Existen 22 movimientos de Belleza Belleza, 4 de Dureza Dureza, 3 de Carisma Carisma y solo 1 de Ingenio Ingenio. No existen movimientos de Dulzura Dulzura.",
    "information": "Los Pokémon de tipo fuego basan sus ataques, principalmente, en el control de este elemento; y la mayoría pueden quemar al Pokémon oponente, mientras que ellos no sufren quemadurasSon apasionados y, algunos, de mal carácter (como el Charizard de Ash); viven en cuevas o zonas rocosas y muy áridas; y, más probable, aun cerca de volcanes activos. Sin embargo, los únicos Pokémon que aparentemente suelen andar por lugares verdes como las praderas, son Ponyta y Rapidash, pudiendo ser que estos lugares les permiten galopar sin obstáculos. También, algunos son más dóciles, como Growlithe, Vulpix y sus respectivas evoluciones.Muchos de estos Pokémon desprenden llamaradas de sus cuerpos, lo cual, aparentemente, no les incomoda; y, dependiendo de su estado de ánimo, puede que estas llamas se aviven o disminuyan.Algunos Pokémon de este tipo evolucionan con una piedra evolutiva llamada piedra fuego, como Vulpix, Pansear y Growlithe, incluyendo a Eevee, que, a pesar de no ser tipo fuego, evoluciona a Flareon; que sí es de este tipo.Entrenadores famosos de tipo fuego incluyen a Blaine, el penúltimo líder de gimnasio de Kanto; Candela la cuarta líder de la región de Hoenn; Fausto el tercer miembro del Alto Mando en la región Sinnoh; Zeo, uno de los 3 primeros líderes del primer gimnasio en la región Teselia; Malva como un miembro del Alto Mando de Kalos; Kiawe un capitán de Alola; y Naboru tercer líder de gimnasio de la región de Galar."
  },

  {
    "type": "AGUA",
    "strong": ["FUEGO", "TIERRA", "ROCA"],
    "weak": ["PLANTA", "ELECTRICO", "DRAGON"],
    "ineffective": ["AGUA", "DRAGON", "PLANTA"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/agua.png",
    "hability": "Existen un total de 33 movimientos de tipo agua (5,33 % del total). En la primera generación se agregaron 9 movimientos (1,45 %), en la segunda generación se agregaron 3 (0,48 %), en la tercera generación se agregaron 6 (0,97 %), en la cuarta generación se agregaron 4 (0,65 %), en la quinta generación se agregaron 4 (0,65 %), en la sexta generación se agregaron 3 (0,48 %) y en la séptima generación se agregaron 4(0,65 %).En batallas: Destaca el tipo especial. Existen 8 movimientos de categoría Categoría físico Físico, 19 de categoría Categoría especial Especial y 5 pertenecen a la categoría Categoría de estado Estado. Destaca el tipo Belleza Belleza, hay 13 de Belleza Belleza, 7 de Dureza Dureza, 6 de Dulzura Dulzura, 2 de Carisma Carisma y 1 de Ingenio Ingenio.",
    "information": "Se dice que es puro y que suele adaptarse a cualquier situación o condición climática, ya que el agua puede adoptar cualquier forma en cualquier momento. Por ejemplo, en un vaso adopta una forma, mientras que, en un cubo, adopta otra distinta. Por eso, los Pokémon de tipo agua se sienten a menudo libres en cualquier sitio donde haya agua a su disposición. La mayoría de estos Pokémon pertenecen también a otros tipos. Por esto, se dice que los Pokémon de agua son muy adaptables y su dinamismo los hace destacarse en concursos, presentaciones y evasión de ataques. Como viven en el agua, muchos de ellos están provistos de aletas.Los Pokémon de agua resultan poco eficaces y débiles frente al tipo planta. Sin embargo, muchos Pokémon de agua son también tipo hielo o pueden aprender ataques de hielo, que resultan efectivos contra los de planta, disminuyendo así su desventaja de tipo. El otro tipo elemental que representa una amenaza para los Pokémon de agua es el eléctrico, exceptuando casos como Swampert, que poseen el tipo tierra como secundario, otorgándoles inmunidad.Algunos Pokémon del tipo agua necesitan la piedra agua para evolucionar."
  },
  {
    "type": "PLANTA",
    "strong": ["AGUA", "ROCA", "TIERRA"],
    "weak": ["BICHO", "VOLADOR", "HIELO", "VENENO", "FUEGO"],
    "ineffective": [
      "ACERO",
      "BICHO",
      "DRAGON",
      "FUEGO",
      "PLANTA",
      "VENENO",
      "VOLADOR"
    ],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/planta.png",
    "hability": "Existen un total de 37 movimientos de tipo planta (un 5,98 % del total), se agregaron 10 movimientos en la primera generación, 3 en la segunda generación, 8 en la tercera generación, 8 en la cuarta generación, 4 en la quinta generación y 4 en la sexta generación.En batallas: Destaca el tipo especial. Existen 13 movimientos de tipo Categoría especial Especial, 10 de tipo Categoría físico Físico y 14 pertenecen a la categoría Categoría de estado Otro.En concursos: Destaca el tipo ingenio. Existen 14 movimientos de Ingenio Ingenio, 10 de Belleza Belleza, 8 movimientos de Carisma Carisma, 3 de Dureza Dureza y 2 de Dulzura Dulzura.",
    "information": "A los Pokémon de tipo planta les gusta cuidar de las flores y a los demás, pero también son grandes luchadores y son expertos en cambios de estado, pudiendo envenenar, paralizar o dormir al rival en combate, mientras que ellos son inmunes a drenadoras pero también a movimientos con esporas y polvos.Normalmente, su cuerpo suele ser igual a alguna especie vegetal. Estos Pokémon suelen desarrollar hojas, flores, entre otros que tienen un crecimiento propio, pero que son controladas por el Pokémon. Otra cosa que caracteriza a los Pokémon de tipo planta es que varios de sus movimientos permiten recuperar puntos de salud; como arraigo, drenadoras o síntesis."
  },
  {
    "type": "TIERRA",
    "strong": ["ACERO", "ELECTRICO", "ROCA", "VENENO", "FUEGO"],
    "weak": ["AGUA", "PLANTA", "HIELO"],
    "ineffective": ["BICHO", "PLANTA"],
    "immune": "El tipo VOLADOR",
    "img": "/assets/img/tipos/tierra.png",
    "hability": "Existen un total de 22 movimientos de tipo tierra (un 3,55 % del total), se agregaron 6 en la primera generación, 4 en la segunda generación, 3 en la tercera generación, 2 en la cuarta generación, 2 en la quinta generación, 5 en la sexta generación y 3 en la séptima generación.En batallas: Destaca el tipo físico. Existen 4 movimientos de categoría Categoría especial Especial, 16 son de categoría Categoría físico Físico y 4 pertenecen a la categoría Categoría de estado Otro.En concursos: Destaca el tipo dureza. Existen 12 movimientos de Dureza Dureza, 4 de Dulzura Dulzura, 3 de Belleza Belleza, 2 de Ingenio Ingenio y solo 1 deCarisma Carisma.",
    "information": "Los Pokémon de este tipo tienen temor al tipo agua, igual que los de tipo roca, pero, a partir de la segunda generación hay excepciones, como es el caso de Wooper y Quagsire, que son de tipo agua y tierra a la vez; también, están Marshtomp, Swampert, Whiscash, Gastrodon, Palpitoad y Seismitoad.Estos Pokémon se pueden hallar en cuevas o zonas rocosas, con excepción de algunos de doble tipo. Groudon, Landorus, y Zygarde son los únicos Pokémon legendarios de este tipo. Una desventaja de este tipo es que, muchos de ellos, no pueden despegarse del suelo, como Diglett; por eso los Pokémon de tipo volador son inmunes a la mayoría de los ataques de este tipo, al igual que los Pokémon que tengan la habilidad levitación. Pero muchos de ellos aprenden movimientos de tipo roca, que son muy eficaces al tipo volador. Los Pokémon de tipo tierra destacan por ser inmunes ante ataques tipo eléctrico y no reciben daño por tormentas de arena. Son buenos combatientes y poseen ataques sumamente devastadores, como fisura y terremoto; entre otros.Entre los entrenadores que se especializan en este tipo se encuentran Giovanni, último líder de gimnasio en Kanto, además de haber sido líder del Team Rocket; Gaia, la segunda miembro del Alto Mando de Sinnoh; Yakón, el quinto líder de gimnasio de Teselia; Hela, la kahuna de la isla Poni en Alola; y Cayena, la primera miembro del Alto Mando de Paldea."
  },
  {
    "type": "ROCA",
    "strong": ["BICHO", "FUEGO", "HIELO", "VOLADOR"],
    "weak": ["LUCHA", "AGUA", "ACERO", "PLANTA", "TIERRA"],
    "ineffective": ["ACERO", "LUCHA", "TIERRA"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/roca.png",
    "hability": "Existen un total de 18 movimientos de tipo roca (un 2,91 % del total), se agregaron 2 movimientos en la primera generación, 3 en la segunda generación, 2 en la tercera generación, 6 en la cuarta generación, 2 en la quinta generación, uno 1 en la sexta generación y 2 en la séptima generación.En batallas: Destaca el tipo físico. Existen solamente 2 movimientos de categoría Categoría especial Especial, 11 de categoría Categoría físico Físico y 4 pertenecen a la categoría Categoría de estado Estado.En concursos: Destaca el tipo dureza. Existen 12 movimientos de Dureza Dureza, 2 movimientos de Belleza Belleza, 1 movimiento de Carisma Carisma y 1 movimiento de Ingenio Ingenio. No existen movimientos de Dulzura Dulzura.",
    "information": "El tipo roca destaca por su gran defensa frente a ataques físicos. Sin embargo, tiene en su contra que presenta varias debilidades con respecto a otros tipos, y los Pokémon de este tipo no se caracterizan por ser muy veloces. Cabe destacar que, la mayoría de los movimientos de tipo roca (sobre todo los físicos), poseen baja precisión a la hora de atacar.Los Pokémon de tipo roca no reciben daño por tormentas de arena y, a partir de la cuarta generación, su defensa especial aumenta en un 50% durante la tormenta.Los Pokémon prehistóricos descubiertos hasta la octava generación, pertenecen a este tipo. Eso es debido a que, la única forma de recuperarlos, es mediante sus fósiles, que son antiguos restos orgánicos petrificados en la corteza terrestre. Estos fósiles preservan suficiente material genético para ser revividos; y nos entregan a unos Pokémon primitivos, teniendo la mayoría la característica común de ser todos del tipo roca. Así que, gracias a este método de conservación, los Pokémon revividos poseen algunas combinaciones de tipos únicas, que no pueden ser halladas en ningún Pokémon moderno, como roca/planta o roca/hielo.Los entrenadores más conocidos de este tipo son: Brock, el primer líder de gimnasio de Kanto; Petra, la primera líder de gimnasio de Hoenn; Roco, el primer líder de gimnasio de Sinnoh; Lino, en Kalos, el segundo líder de gimnasio; Mayla, la segunda Kahuna y miembro del Alto Mando en Alola; y Morris, el sexto líder de gimnasio en Galar."
  },
  {
    "type": "VOLADOR",
    "strong": ["PLANTA", "LUCHA", "BICHO"],
    "weak": ["ELECTRICO", "ROCA", "HIELO"],
    "ineffective": ["ACERO", "ROCA", "ELECTRICO"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/volador.png",
    "hability": "Existen un total de 26 movimientos de tipo volador (un 3,88 % del total), se agregaron 7 en la primera generación, 1 en la segunda generación, 4 en la tercera generación, 7 en la cuarta generación, 3 en la quinta generación, 2 en la sexta generación y 2 en la séptima generación.En batallas: Destaca el tipo físico. Existen 8 movimientos de tipo Categoría especial Especial, 14 de tipo Categoría físico Físico y 5 pertenecen a la categoría Categoría de estado Otro.En concursos: Destaca el tipo carisma. Existen 11 movimientos de Carisma Carisma, 5 movimientos de Ingenio Ingenio, 3 movimientos de Dulzura Dulzura, 3 de Belleza Belleza y 2 de Dureza Dureza.",
    "information": "Los Pokémon de tipo volador son rápidos y con ataques que normalmente son de contacto físico, o en los que utilizan el viento a su favor. En su mayoría, los Pokémon de tipo volador poseen alas, aunque hay excepciones; como Rayquaza y Gyarados, que siempre flotan sin poseer ni alas ni plumas; o Tornadus, Thundurus y Landorus, que montan sobre nubes. Son inmunes al tipo tierra, puesto que, al volar, los ataques de este tipo (salvo ataque arena y mil flechas) no les afectan. Tampoco pueden ser envenenados al entrar a un campo de combate con púas tóxicas ni recibir daño de púas.Los Pokémon de tipo volador tienen algunas desventajas. Los Pokémon eléctricos pueden paralizar a los Pokémon voladores haciéndolos caer bruscamente. Los Pokémon de tipo hielo pueden congelar sus alas con la misma consecuencia final que los Pokémon eléctricos. Los Pokémon de tipo roca son tan duros que los ataques de los voladores no les producen apenas daño, y vemos que los tipo planta y bicho son los más débiles frente a los voladores (por su dieta en la vida real).Los Pokémon con la habilidad alas vendaval aumentan +1 la prioridad normal de los movimientos de tipo volador del usuario siempre y cuando este tenga sus HP al máximo (Siempre antes de la séptima generación), lo que significa que, casi siempre, van a atacar antes que otros Pokémon, sin importar su velocidad."
  },
  {
    "type": "LUCHA",
    "strong": ["ACERO", "HIELO", "NORMAL", "ROCA", "SINIESTRO"],
    "weak": ["VOLADOR", "PSIQUICO", "HADA"],
    "ineffective": ["BICHO", "VOLADOR", "PSIQUICO", "HADA", "VENENO"],
    "immune": "El tipo FANTASMA",
    "img": "/assets/img/tipos/lucha.png",
    "hability": "Existen un total de 43 movimientos de tipo lucha (6,95 % sobre el total), se agregaron 9 en la primera generación, 8 en la segunda generación, 7 en la tercera generación, 8 en la cuarta generación, 7 en la quinta generación, 3 en la sexta generación y 1 en la séptima generación.En batallas: destaca el tipo físico. Existen 33 movimientos de tipo Categoría físico Físico, 5 de tipo Categoría especial Especial y 4 pertenecen a la categoría Categoría de estado Otro.En concursos: destaca el tipo carisma. Existen 22 movimientos de Carisma Carisma, 12 de Dureza Dureza, 4 de Belleza Belleza y 4 de Ingenio Ingenio. No existen movimientos de Dulzura Dulzura.",
    "information": "Este tipo de Pokémon son especialistas en el combate cuerpo a cuerpo, se podría decir que son opuestos a los del tipo psíquico, ya que, estos últimos, dependen del ataque especial; mientras que los del tipo lucha se especializan en ataque físico. En su mayoría, sus características están equilibradas (como Hitmontop o Medicham) o si no, son veloces luchadores con grandes puntos de ataque (como Lucario e Infernape). Su desarrollo varía: de veloz desarrollo como Monferno a Infernape; o tardíos en su desarrollo como Croagunk a Toxicroak. Algunos incluso requieren diversas condiciones para evolucionar (Tyrogue necesita igualar su ataque con su defensa para evolucionar en Hitmontop, Riolu evoluciona de día mediante la amistad, y Poliwhirl necesita la piedra agua).El hecho de que varios Pokémon de tipo lucha evolucionen de métodos especiales, hacen referencia a los viajes internos que realizan los luchadores en busca de conocimiento para triunfar o de la paz interior.Independientemente de esto, el tipo lucha es el tipo con más ventajas frente a otros tipos, junto con el tipo tierra, teniendo un total de 5.Entre los entrenadores famosos en la serie, se encuentran: el maestro del dojo de karate de ciudad Azafrán Karateka Kiyo; Bruno; el segundo miembro del Alto Mando en Kanto y Johto; Aníbal el quinto líder de gimnasio de Johto; Marcial el segundo líder de gimnasio de Hoenn; Brega; la tercera líder de gimnasio de Sinnoh (cuarta en Pokémon Platino); Lotto, un miembro del alto mando de Teselia; Corelia, la tercera lider de gimnasio en Kalos; Kaudan, el primer Kahuna y posteriormente un miembro del alto mando de Alola; y Judith, cuarta líder de gimnasio de Galar (en Pokémon Espada)."
  },
  {
    "type": "VENENO",
    "strong": ["PLANTA", "HADA"],
    "weak": ["TIERRA", "PSIQUICO"],
    "ineffective": ["FANTASMA", "ROCA", "TIERRA", "VENENO"],
    "immune": "El tipo ACERO",
    "img": "/assets/img/tipos/veneno.png",
    "hability": "Existen un total de 23 movimientos de tipo veneno (un 3,72 % del total), se agregaron 8 en la primera generación, 1 en la segunda generación, 2 en la tercera generación, 5 en la cuarta generación, 5 en la quinta generación y 2 en la sexta generación.En batallas: Destaca el tipo especial. Existen 6 movimientos de tipo Categoría físico Físico, 8 pertenecen a la categoría Categoría de estado Otro y 9 son de tipo Categoría especial Especial.En concursos: Destaca el tipo ingenio. Existen 10 movimientos de Ingenio Ingenio, 7 de Dureza Dureza, 4 de Belleza Belleza, 2 de Carisma Carisma. No existen movimientos de Dulzura Dulzura.",
    "information": "El tipo veneno es frecuente en Pokémon; suele encontrarse en zonas donde hay cuevas, pantanos o en sus cercanías. Muchos Pokémon de este tipo pueden expulsar de sus cuerpos distintas sustancias nocivas como gases, ácidos, venenos, esporas u olores malolientes. También, los Pokémon del tipo veneno están basados en seres vivientes que son, generalmente, venenosos. Por ejemplo: serpientes, arañas, ranas, insectos, plantas y hongos; y, también, en objetos contaminantes como lodo y bolsas de basura.Un Pokémon de tipo veneno no puede ser envenenado (excepto si evoluciona de un Pokémon que ya estaba previamente envenenado). Y un Pokémon de tipo veneno que no sea de tipo volador ni tenga la habilidad levitación, anula el efecto de púas tóxicas de modo que, ningún Pokémon resultará envenenado al entrar al campo de combate.Una característica muy curiosa que tienen algunos de los Pokémon del tipo veneno es su similitud con los ninjas, además de que, en la primera generación, el líder especialista en este tipo, es un ninja; muchos Pokémon siguen este concepto: Koffing, parecido a una bomba de humo; Crobat, y su velocidad y sigilo; o Toxicroak, con sus zarpas en las muñecas. Esta característica se ve reforzada por el hecho de que una de las características más favorables de este tipo es la velocidad.Hay 6 expertos en Pokémon de tipo veneno: Koga, un líder de gimnasio y más tarde Alto Mando de la Liga Pokémon de Kanto; Sachiko e Hiedra, unas líderes de gimnasio; Ponzi, un participante del Supertorneo Tipo: Veneno, Francine, la comandante del Team Skull y Sófora, rival del jugador en el DLC La isla de la armadura, solo en Pokémon Espada y líder de gimnasio en el DLC Nieves de la Corona.Una de las principales características generales de los Pokémon de tipo veneno es que su piel o cuerpo es, generalmente, de color morado, excepto los de tipo veneno secundario."
  },
  {
    "type": "HADA",
    "strong": ["DRAGON", "LUCHA", "SINIESTRO"],
    "weak": ["VENENO", "ACERO"],
    "ineffective": ["ACERO", "FUEGO", "VENENO"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/hada.png",
    "hability": "Existen 22 movimientos de tipo hada en total (3,55 % sobre el total) de los cuales 3 fueron agregados en la segunda generación, 14 en la sexta generación y 5 en la séptima generación:En combate: Destaca la categoría estado. Existen 11 pertenecen a la categoría Categoría de estado Estado , 2 de tipo Categoría físico Físico y 9 movimientos de tipo Categoría especial Especial.En concursos: Destaca el tipo belleza. Existen 9 movimientos de Belleza Belleza, 6 de Dulzura Dulzura, 2 de Ingenio Ingenio. No existen movimientos de Dureza Dureza ni de Carisma Carisma.",
    "information": "El tipo hada representa, principalmente, la pureza, la luz, el bien y el poder mágico, siendo esto lo más característico de esta especie. Se suelen encontrar, principalmente, en zonas al aire libre, rodeadas de flores o elementos similares. Fue introducido para equilibrar el poder superior de los Pokémon de tipo dragón, tal como se hizo en la segunda generación con los tipos acero y siniestro. Por lo general, son Pokémon con un nivel alto de defensa especial, como Sylveon, Mr. Mime, Carbink o Florges; además, la mayor parte posee un nivel alto de PS como Wigglytuff, Azumarill o Aromatisse; sin embargo, la mayoría cuenta con un valor de ataque muy bajo, como Whimsicott, Togekiss o Tinkaton. Otra particularidad es que la mayoría de los Pokémon de tipo hada, pueden aprender el movimiento deseo; tal vez debido a la idea de que las hadas pueden cumplir deseos o sueños. El tipo veneno representa su máxima debilidad junto con el tipo acero. Al contrario de los Pokémon de tipo psíquico, que usan sus ataques con el poder de su mente, estos usan poderes sobrenaturales y místicos. La mayoría de los Pokémon de este tipo son de aspecto tierno y suave, pero a la vez son muy poderosos."
  },
  {
    "type": "BICHO",
    "strong": ["PLANTA", "PSIQUICO", "SINIESTRO"],
    "weak": ["VOLADOR", "FUEGO", "ROCA"],
    "ineffective": [
      "ACERO",
      "FANTASMA",
      "FUEGO",
      "HADA",
      "LUCHA",
      "VENENO",
      "VOLADOR"
    ],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/bicho.png",
    "hability": "Existen un total de 25 movimientos de tipo bicho (4,04 % del total). En la primera generación se agregaron 4 (0,65 %), en la segunda generación se agregaron 3 (0,48 %), en la tercera generación se agregaron 3 (0,48 %), en la cuarta generación se agregaron 7 (1,13 %), en la quinta generación se agregaron 4 (0,65 %) y en la sexta generación se agregaron 4 (0,65 %).En combate: Destaca el tipo físico. Existen 11 movimientos de tipo Categoría físico Físico, 9 pertenecen a la categoría Categoría de estado Estado y 5 son de tipo Categoría especial Especial.En concursos: Destaca el tipo ingenio. Existen 7 movimientos de Ingenio Ingenio, 5 de Belleza Belleza, 7 de Carisma Carisma, 4 de Dulzura Dulzura y sólo 2 de Dureza Dureza.",
    "information": "Este grupo de Pokémon se caracteriza por su crecimiento rápido, ya que, en general, no tardan mucho en evolucionar. Viven primordialmente en los bosques y zonas cercanas a estos, algunos son un poco más difíciles de divisar debido a que se encuentran en copas de árboles donde anidan. Muchos de los Pokémon de tipo bicho tienen como tipo secundario volador, lo cual los hace más resistentes a los ataques del tipo planta y tipo lucha, pero los hace más débiles al tipo roca.A partir de la quinta generación, se puede ver que es el tipo que prefieren los artistas, debido, principalmente, a que suelen ser de bonitos colores y de carácter estoico y alegre, por lo que podría decirse que personifican la belleza de la naturaleza."
  },
  {
    "type": "SINIESTRO",
    "strong": ["FANTASMA", "PSIQUICO"],
    "weak": ["BICHO", "LUCHA", "HADA"],
    "ineffective": ["LUCHA", "HADA", "SINIESTRO"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/siniestro.png",
    "hability": "Existen un total de 32 movimientos de tipo siniestro (un 5,17 % del total). Se agregó 1 en la primera generación, 5 en la segunda generación, 7 en la tercera generación, 11 en la cuarta generación, 5 en la quinta generación y 3 en la sexta generación.Los movimientos de este tipo están especializados en usar la fuerza del adversario en su contra y explotar sus debilidades. Esto se consigue al disminuir una característica y prohibir algún movimiento u objeto (como golpe mordaza o desarme), aunque también puede beneficiarse de las fortalezas del oponente (como juego sucio).En batallas: destaca el tipo físico. Existen sólo 3 movimientos de categoría Categoría especial Especial mientras que hay 20 de categoría Categoría físico Físico y 14 pertenecen a la categoría Categoría de estado Otro.En concursos: destaca el tipo ingenio. Existen 17 movimientos de Ingenio Ingenio, 8 de Dureza Dureza, 4 de Carisma Carisma, 3 de Dulzura Dulzura. No existen movimientos de Belleza Belleza.",
    "information": "Como bien indica su nombre, representan la oscuridad y la maldad, asimismo, puede simplemente tratarse de criaturas más acostumbradas a la noche que al día.Los Pokémon de tipo siniestro son, en su mayoría, agresivos y misteriosos; por lo tanto, encontrar un tipo siniestro es un poco complicado. Fueron agregados en la segunda generación para presentar una debilidad ante el tipo psíquico, que, hasta entonces, sólo tenía el tipo bicho (cuyos movimientos no representaban una amenaza) y el tipo fantasma (situación parecida respecto a los movimientos).Suelen ser de carácter malicioso, cruel, fríos y astutos. Independientemente de esto, no son necesariamente malvados. Absol, por ejemplo; tiene fama de ser un mal presagio, cuando, en realidad, alerta a las personas de desastres próximos.Los tipo siniestro, generalmente, están basados en animales de la vida real que, por lo normal, resultan intimidantes y aterradores, como lo son: lobos, pirañas, tiburones, escorpiones, cocodrilos y hasta grandes felinos.A estos Pokémon les cuesta formar lazos de amistad con entrenadores, pero, al formar uno, debido a la barrera moral que rompen al hacerlo, este lazo jamás será roto, siendo muy fieles a su entrenador e incluso dando su vida por él.A partir de la séptima generación, los Pokémon de tipo siniestro son inmunes a movimientos de la categoría estado que hayan sido lanzados por Pokémon que posean la habilidad bromista.Los Pokémon del tipo siniestro, a partir de la segunda generación, junto a los veneno, son, mayoritariamente, usados por los villanos del juego. En Pokémon Oro, Plata y Cristal; el Team Rocket ejecutivo usa a Murkrow, Houndour y Houndoom. En Pokémon Rubí, Zafiro y Esmeralda; y Pokémon Rubí Omega y Zafiro Alfa; el Equipo Magma y Equipo Aqua usan a Mightyena, Crawdaunt y Sharpedo. En Pokémon Diamante, Perla y Platino; el Equipo Galaxia usa a Stunky, Weavile y Honchkrow. En Pokémon Negro y Blanco; el Equipo Plasma usa a Scraggy, Liepard y Sandile. En Pokémon Negro 2 y Pokémon Blanco 2; usa a Weavile. Y, por último, en Pokémon X e Y; utilizan Pokémon de varias generaciones como Mightyena, Liepard, Houndoom, etc.Los entrenadores más reconocidos del tipo siniestro son: Karen, cuarta miembro del Alto Mando de Johto; Sixto, primer miembro del Alto Mando de Hoenn; Aza, un miembro del Alto Mando de Teselia; Denio, el kahuna de la isla Ula-Ula en Alola; y Nerio, líder de gimnasio de Galar, ubicado en Pueblo Crampón."
  },
  {
    "type": "FANTASMA",
    "strong": ["FANTASMA", "PSIQUICO"],
    "weak": ["FANTASMA", "SINIESTRO"],
    "ineffective": ["SINIESTRO"],
    "immune": "El tipo NORMAL",
    "img": "/assets/img/tipos/fantasma.png",
    "hability": "Existen un total de 25 movimientos de tipo fantasma (4,04 % sobre el total), 3 en la primera generación, 5 en la segunda generación (contando maldición), 3 en la tercera generación, 4 en la cuarta generación, 1 en la quinta generación, 2 en la sexta generación y 7 en la séptima generaciónEn batallas: Destaca el tipo físico. Existen 12 movimientos de categoría Categoría físico Físico, 7 pertenecen a la categoría Categoría de estado Otro y 5 son de categoría Categoría especial Especial.En concursos: Destaca el tipo ingenio. Existen 11 movimientos de Ingenio Ingenio, 4 de Dureza Dureza, 2 de Dulzura Dulzura y solo 1 en Carisma Carisma. No existen movimientos de Belleza Belleza.",
    "information": "Se caracteriza por ser un tipo con pocos Pokémon y movimientos; y, también, porque sus Pokémon poseen, generalmente, pocos PS (a excepción de Drifblim, Giratina, Jellicent, Annihilape y algunos más), principalmente, Shedinja (con tan solo un punto de PS). En combate resultan muy útiles, ya que poseen dos inmunidades: el tipo lucha y el tipo normal, de las cuales los ataques de estas son muy comunes, pero, a pesar de que el tipo fantasma es inmune al tipo normal, a su vez, los fantasmas son inútiles también contra los normales. A partir de la sexta generación, no les afectan movimientos ni habilidades que impiden escapar al Pokémon de los combates, como bloqueo o sombra trampa.Los Pokémon que pertenecen al tipo fantasma, generalmente, se relacionan con el terror, lo oscuro y el más allá. Suelen vivir en casas abandonadas, cementerios, torres fúnebres y lugares oscuros e inhabitados. Gran parte de estos Pokémon esbozan una sonrisa siniestra y tenebrosa. Otra característica de los Pokémon fantasma, es que son, extremadamente, traviesos; y les encantan gastarles bromas pesadas a los humanos y otros Pokémon. También, les encantan ver la cara de miedo de las personas que invaden su territorio. Lo curioso de estos Pokémon es que, cuanto más miedo se les tenga, estos lo absorberán y serán más fuertes."
  },
  {
    "type": "PSIQUICO",
    "strong": ["LUCHA", "VENENO"],
    "weak": ["BICHO", "FANTASMA", "SINIESTRO"],
    "ineffective": ["ACERO", "PSIQUICO"],
    "immune": "El tipo SINIESTRO",
    "img": "/assets/img/tipos/psiquico.png",
    "hability": "Existen un total de 54 movimientos de tipo Psíquico (un 8,72 % del total). Se agregaron 15 movimientos en la primera generación, 2 en la segunda generación, 11 en la tercera generación, 13 en la cuarta generación, 12 en la quinta generación y solo 1 en la sexta generación.En batallas: Destaca el tipo otro. Existen 4 movimientos de tipo Categoría físico, 16 de tipo Categoría especial y 35 de tipo Categoría de estado.En concursos: Destaca el tipo ingenio. Existen 24 movimientos de tipo Ingenio, 11 de Belleza 10 de Carisma, 9 de Dulzura y ninguno de Dureza.",
    "information": "A él pertenecen un número considerable de Pokémon, siendo el tipo con mayor número de Pokémon legendarios, con 17 en total. Los Pokémon de este tipo suelen ser muy inteligentes y, a menudo, se les atribuye capacidades como prever acciones futuras, hacer levitar objetos o incluso a ellos mismos.Se puede localizar a este tipo de Pokémon en cuevas o zonas cercanas a estas. Por ejemplo: Abra se puede capturar en la Cueva Granito; y Chimecho se puede capturar en la cima del Monte Pírico, en el lado exterior (ambos en la tercera generación).Durante la primera generación solo tenían como debilidad el tipo bicho, pues no existía todavía el tipo siniestro, y eran inmunes al tipo fantasma."
  },
  {
    "type": "NORMAL",
    "strong": ["NORMAL"],
    "weak": ["LUCHA"],
    "ineffective": ["ACERO", "ROCA"],
    "immune": "El tipo FANTASMA",
    "img": "/assets/img/tipos/normal.png",
    "hability": "Existen un total de 171 movimientos de tipo normal (el 27,63 % del total), 73 movimientos son de la primera generación, 32 de la segunda generación, 28 de la tercera generación, 15 de la cuarta generación, 15 de la quinta generación y 8 son de la sexta generación. 4 movimientos de la primera generación cambiaron su tipo en la segunda generación: ataque arena (tipo Tipo tierra Tierra), Golpe karate (tipo Tipo lucha Lucha), mordisco (tipo Tipo siniestro Siniestro) y tornado (tipo Tipo volador Volador).En batallas: Destaca la categoría estado. Existen 87 movimientos de categoría Categoría de estado Estado, 65 pertenecen a la categoría Categoría físico Físico y 19 a la categoría Categoría especial Especial.En concursos: Destaca el tipo dulzura. Existen 49 movimientos de Dulzura Dulzura, 39 de Dureza Dureza, 34 de Carisma Carisma, 27 de Ingenio Ingenio y 22 de Belleza Belleza.",
    "information": "El tipo normal abarca la mayor cantidad y variedad de movimientos que el resto de tipos. Gran parte de estos son movimientos que no realizan daño o no lo hacen directamente, sino que afectan a las características o estados del Pokémon.Los tipos normal son los más diversos entre los Pokémon, con características variadas, desarrollos y requisitos para las evoluciones diferentes de cada uno, al igual que diferir en las zonas donde se pueden capturar, desde bosques, cuevas, montañas, ciudades, etc.El tipo normal (junto al tipo eléctrico) es el tipo puro que posee menos debilidades con solo una, el tipo lucha; pero al mismo tiempo es el tipo con menos fortalezas, ya que no es efectivo contra ningún tipo elemental de Pokémon.Los entrenadores más reconocidos de este tipo son: Blanca, la tercera líder de gimnasio en la región Johto; Norman, el quinto líder de gimnasio en la región Hoenn; Aloe, la segunda líder de gimnasio en la región Teselia; Cheren como reemplazo de Aloe en los videojuegos Pokémon Negro 2 y Blanco 2; en Alola el capitán Liam; y Laureano en la región de Paldea."
  },
  {
    "type": "DRAGON",
    "strong": ["DRAGON"],
    "weak": ["HADA", "HIELO", "DRAGON"],
    "ineffective": ["ACERO"],
    "immune": "El tipo HADA",
    "img": "/assets/img/tipos/dragon.png",
    "hability": "Existe un total de 17 movimientos de tipo dragón (2,26 % del total). En la primera generación se agregó 1 (0,16 %), en la segunda generación se agregaron 3 (0,48 %), en la tercera generación se agregaron 2 (0,32 %), en la cuarta generación se agregaron 5 (0,81 %), en la quinta generación se agregaron 2 (0,32 %), en la sexta generación no se agregó ningún movimiento de este tipo y en la séptima generación se agregaron 4 (0,65 %).En batallas: Destaca el tipo especial. Existen 9 movimientos de tipo Categoría especial Especial, 6 de tipo Categoría físico Físico y sólo 1 pertenece a la categoría Categoría de estado Otro.En concursos: Destaca el tipo carisma. Existen 8 movimientos de Carisma Carisma, 3 de Dureza Dureza y 2 de Ingenio Ingenio. No existen movimientos de Belleza Belleza ni Dulzura Dulzura.",
    "information": "Es un tipo elemental ancestral, suelen ser Pokémon que cuesta capturar y/o ver, la mayoría de estos Pokémon suelen vivir en cavernas y/o lagos. La mayoría de estos Pokémon suelen ser Pokémon legendarios.Los movimientos de tipo dragón solo son efectivos contra Pokémon de su propio tipo, el tipo Dragón. Por lo tanto, es después del tipo normal el tipo con menos fortalezas contra otros tipos, no existiendo nunca un Pokémon con doble desventaja a él. En la sexta generación, se le incluye una nueva debilidad, el tipo hada."
  },
  {
    "type": "HIELO",
    "strong": ["DRAGON", "PLANTA", "TIERRA", "VOLADOR"],
    "weak": ["FUEGO", "LUCHA", "ROCA", "ACERO"],
    "ineffective": ["ACERO", "AGUA", "FUEGO", "HIELO"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/hielo.png",
    "hability": "Existen un total de 21 movimientos de tipo hielo (3,39 % sobre el total), 6 en la primera generación, 2 en la segunda generación, 4 en la tercera generación, 3 en la cuarta generación, 5 en la quinta generación, 1 en la sexta generación y 3 en la séptima generación.En batallas: Destaca el tipo especial. Existen 10 movimientos de tipo Categoría especial Especial, 8 de tipo Categoría físico Físico y 4 pertenecen a la categoría Categoría de estado Otro.En concursos: Destaca el tipo belleza. Existen 19 movimientos de Belleza Belleza y solo 2 de Carisma Carisma. No existen movimientos de Dulzura Dulzura, Dureza Dureza o Ingenio Ingenio.",
    "information": "Destacan por su gran resistencia y adaptación al medio frío o glaciar, como son las cimas de las montañas, las cavernas y cuevas heladas, o incluso los polos. Tienen la capacidad de congelar al enemigo en combate, mientras que ellos no pueden padecer dicho estado. Además, pueden realizar ataques devastadores, como frío polar, al cual son inmunes. No reciben daño por granizo.Muchos Pokémon de este tipo representan seres vivos que se encuentran en regiones y paisajes helados, como lo son: osos polares, focas, leones marinos y morsas."
  },
  {
    "type": "ELECTRICO",
    "strong": ["AGUA", "VOLADOR"],
    "weak": ["TIERRA"],
    "ineffective": ["DRAGON", "ELECTRICO", "PLANTA"],
    "immune": "El tipo TIERRA",
    "img": "/assets/img/tipos/electrico.png",
    "hability": "Existen un total de 32 movimientos de tipo eléctrico (5,17 % sobre el total), 5 en la primera generación (0,81 % sobre el total), 2 en la segunda generación (0,32 %), 3 en la tercera generación (0,48 %), 4 en la cuarta generación (0,65 %), 6 en la quinta generación (0,81 %), 7 en la sexta generación (1,13 %) y 5 en la séptima generación (0,81 %). El más poderoso por ahora es el movimiento característico de Zekrom, ataque fulgor, aunque el movimiento bola voltio, aprendido por un Pokémon rápido, como Electrode, puede causar más daño.Muchos movimientos de tipo eléctrico juegan con la velocidad. Algunos, como moflete estático y onda voltio buscan aprovecharse de paralizar al rival, lo que reduce su velocidad. Otros se aprovechan de esto, como bola voltio o electrotela. Voltiocambio permite al Pokémon cambiarse por otro tras golpear.En batallas: destaca el tipo especial. Existen 11 movimientos de tipo Categoría especial Especial, 9 de tipo Categoría físico Físico y 8 pertenecen a la categoría Categoría de estado Otro.En concursos: destaca el tipo carisma. Existen 13 movimientos de Carisma Carisma, 7 de Ingenio Ingenio, 4 de Belleza Belleza, 2 de Dulzura Dulzura y solo 1 movimiento de Dureza Dureza.",
    "information": "Los Pokémon de tipo eléctrico tienen hábitats variados, desde bosques y praderas, hasta ciudades y centrales eléctricas. Los Pokémon de tipo dragón, eléctrico y planta son resistentes al tipo eléctrico, y aún más los de tipo tierra, quienes son inmunes a los ataques eléctricos. Por consiguiente, los Pokémon eléctricos deben de ser muy precavidos con los ataques de tipo tierra, el cual representa su única debilidad.Los Pokémon de tipo eléctrico almacenan electricidad estática en sus cuerpos y luego la liberan en forma de rayos por diferentes partes: mejillas, colas, orejas o antenas. Pero, cuando un Pokémon de este tipo absorbe demasiada electricidad (ya sea por tormentas eléctricas o por aparatos que funcionen con electricidad), puede llegar a ser muy peligroso, debido a que tiene demasiada energía contenida en su interior que no puede ser liberada en poco tiempo, haciéndolos enfermar. Cuando eso pasa, hay que quitarles la electricidad en exceso a la mayor brevedad posible antes de que, en el peor de los casos, el Pokémon se sobrecargue y explote."
  },
  {
    "type": "ACERO",
    "strong": ["HADA", "HIELO", "ROCA"],
    "weak": ["FUEGO", "LUCHA", "TIERRA"],
    "ineffective": ["AGUA", "ACERO", "ELECTRICO", "FUEGO"],
    "immune": "No tiene inmunidades",
    "img": "/assets/img/tipos/acero.png",
    "hability": "Existen un total de 24 movimientos de tipo acero (3,88 % del total). En la segunda generación se agregaron 3 movimientos (0,48 %). En la tercera generación se agregaron 4 movimientos (0,65 %). En la cuarta generación se agregaron 7 movimientos (1,13 %). En la quinta generación se agregaron 4 movimientos (0,65 %). En la sexta generación se agregó 1 movimiento (0,16 %). Y en la séptima generación se agregaron 5 movimientos (0,81 %) No existen movimientos de tipo acero en la primera generación.En combate: Destaca la categoría físico. Existen 14 movimientos de categoría Categoría físico Físico, 6 de categoría Categoría de estado Estado y 3 de categoría Categoría especial Especial.En concursos: Destaca el tipo carisma. Existen 8 movimientos de Carisma Carisma, 4 de Belleza Belleza, 4 de Dureza Dureza, 3 de Ingenio Ingenio y ninguno de Dulzura Dulzura.",
    "information": "Los Pokémon de tipo acero destacan por tener altas defensas, pero también por poseer poca velocidad. No se pueden envenenar en condiciones normales y no reciben daño por tormentas de arena. Son muy buenos luchadores; los ataques físicos raras veces les causan mucho daño. Su punto débil puede resultar ser la velocidad y la debilidad a los ataques de tipo fuego, tierra y lucha.Los Pokémon de este tipo se ubican principalmente en cuevas y cavernas, aunque hay algunos que se pueden encontrar en zonas urbanas como fábricas o centrales eléctricas; como ejemplo, Skarmory suele habitar en zonas donde cae ceniza.Varios entrenadores populares de este tipo son Yasmina, la líder de gimnasio de ciudad Olivo; Acerón, líder de gimnasio de ciudad Canal; Máximo Peñas, uno de los posibles campeones de Hoenn; Lario, un miembro del Alto Mando de Alola y ex capitán de Alola; Tileo, Alto Mando de Kalos; Rose, el líder de Macrocosmos y presidente de la Liga Pokémon de Galar, y Peony un exlíder de gimnasio de Galar."
  }
]
